In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'key1': ['a','a','b','b','a'],
               'key2': ['one','two','one','two','one'],
               'data1':np.random.randn(5),
               'data2':np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one -0.400816  2.547968
1    a  two  0.057897 -1.355481
2    b  one -0.574487 -2.174709
3    b  two -0.396979  0.811497
4    a  one -0.360151  0.889371

In [4]:
grouped=df['data1'].groupby(df['key1'])
grouped

In [5]:
grouped.mean()

key1
a   -0.234357
b   -0.485733
Name: data1, dtype: float64

In [6]:
grouped.sum()

key1
a   -0.703070
b   -0.971466
Name: data1, dtype: float64

In [7]:
means=df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one    -0.380484
      two     0.057897
b     one    -0.574487
      two    -0.396979
Name: data1, dtype: float64

In [8]:
means.unstack()

key2       one       two
key1
a    -0.380484  0.057897
b    -0.574487 -0.396979

In [9]:
states=np.array(['ohio','california','california','ohio','ohio'])
years=np.array([2005,2005,2006,2005,2006])

In [10]:
means=df['data1'].groupby([states,years]).mean()
means

california  2005    0.057897
            2006   -0.574487
ohio        2005   -0.398898
            2006   -0.360151
Name: data1, dtype: float64

In [11]:
df.groupby(df['key1']).mean()

         data1     data2
key1
a    -0.234357  0.693952
b    -0.485733 -0.681606

In [12]:
df.groupby([df['key1'],df['key2']]).mean()

              data1     data2
key1 key2
a    one  -0.380484  1.718669
     two   0.057897 -1.355481
b    one  -0.574487 -2.174709
     two  -0.396979  0.811497

In [13]:
df.groupby([df['key1'],df['key2']]).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [14]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [15]:
for key,group in df.groupby('key1'):
    print(key)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.400816  2.547968
1    a  two  0.057897 -1.355481
4    a  one -0.360151  0.889371
b
  key1 key2     data1     data2
2    b  one -0.574487 -2.174709
3    b  two -0.396979  0.811497

In [16]:
for (key1,key2),group in df.groupby(['key1','key2']):
    print(key1,key2)
    print(group)

a one
  key1 key2     data1     data2
0    a  one -0.400816  2.547968
4    a  one -0.360151  0.889371
a two
  key1 key2     data1     data2
1    a  two  0.057897 -1.355481
b one
  key1 key2     data1     data2
2    b  one -0.574487 -2.174709
b two
  key1 key2     data1     data2
3    b  two -0.396979  0.811497

In [17]:
pieces=dict(list(df.groupby('key1')))
pieces

{'a':   key1 key2     data1     data2
 0    a  one -0.400816  2.547968
 1    a  two  0.057897 -1.355481
 4    a  one -0.360151  0.889371,
 'b':   key1 key2     data1     data2
 2    b  one -0.574487 -2.174709
 3    b  two -0.396979  0.811497}

In [18]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.574487 -2.174709
3    b  two -0.396979  0.811497

In [19]:
df.groupby('key1')['data1'].mean()

##same as df['data1'].groupby('key1')

key1
a   -0.234357
b   -0.485733
Name: data1, dtype: float64

In [20]:
df.groupby(['key1','key2'])['data1'].mean()

key1  key2
a     one    -0.380484
      two     0.057897
b     one    -0.574487
      two    -0.396979
Name: data1, dtype: float64

In [21]:
## grouping with dict and series

In [22]:
people=pd.DataFrame(np.random.randn(5,5),columns=['a','b','c','d','e'],index=['joe','steve','wes','jim','travis'])

In [23]:
people.iloc[2:3,[1,2]]=np.nan
people

               a         b         c         d         e
joe    -1.608788 -1.802352  0.053928 -0.946269  1.551752
steve  -0.893405  0.380199  0.153510  1.064519  2.112862
wes    -1.337585       NaN       NaN -0.469622  0.550054
jim    -0.396916  0.877118  1.923082  1.356280 -0.097968
travis -0.512606 -0.822438 -0.261645  0.917743 -0.574286

In [24]:
dict={'a':'red','b':'red','c':'red','d':'blue','e':'blue','f':'blue'}
people.groupby(dict,axis=1).sum()

            blue       red
joe     0.605484 -3.357213
steve   3.177381 -0.359695
wes     0.080432 -1.337585
jim     1.258312  2.403284
travis  0.343457 -1.596689

In [25]:
series=pd.Series(dict)

In [26]:
series

a     red
b     red
c     red
d    blue
e    blue
f    blue
dtype: object

In [27]:
people.groupby(series,axis=1).sum()

            blue       red
joe     0.605484 -3.357213
steve   3.177381 -0.359695
wes     0.080432 -1.337585
jim     1.258312  2.403284
travis  0.343457 -1.596689

In [28]:
people.groupby(len).sum()

          a         b         c         d         e
3 -3.343289 -0.925234  1.977010 -0.059610  2.003839
5 -0.893405  0.380199  0.153510  1.064519  2.112862
6 -0.512606 -0.822438 -0.261645  0.917743 -0.574286

In [29]:
key_list=['a','a','a','b','b']
people.groupby([len,key_list]).sum()

            a         b         c         d         e
3 a -2.946373 -1.802352  0.053928 -1.415891  2.101807
  b -0.396916  0.877118  1.923082  1.356280 -0.097968
5 a -0.893405  0.380199  0.153510  1.064519  2.112862
6 b -0.512606 -0.822438 -0.261645  0.917743 -0.574286

In [30]:
columns=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],names=['CTY','TENOR'])

In [31]:
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['CTY', 'TENOR'])

In [32]:
hier_df=pd.DataFrame(np.random.randn(4,5),columns=columns)

In [33]:
hier_df

CTY          US                            JP
TENOR         1         3         5         1         3
0      0.371586 -0.518192 -0.022044  1.949525 -0.319112
1     -0.344025 -1.701137 -0.045166  0.033340 -0.416613
2     -0.781138  0.872401  0.111835  1.278937  1.606173
3     -2.065049  1.863106 -0.498966  0.279805 -1.155218

In [34]:
hier_df.groupby(level='TENOR',axis=1).count()

TENOR  1  3  5
0      2  2  1
1      2  2  1
2      2  2  1
3      2  2  1

In [35]:
hier_df.groupby(level='CTY',axis=1).count()

CTY  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [36]:
## using our own agg functions

In [37]:
def range(arr):
    return arr.max()-arr.min()

df.groupby('key1').agg(range)

         data1     data2
key1
a     0.458713  3.903449
b     0.177508  2.986206

In [38]:
df

  key1 key2     data1     data2
0    a  one -0.400816  2.547968
1    a  two  0.057897 -1.355481
2    b  one -0.574487 -2.174709
3    b  two -0.396979  0.811497
4    a  one -0.360151  0.889371

In [39]:
df.groupby('key1')['data1'].describe()

,count,mean,std,min,25%,50%,75%,max
key1,,,,,,,,
a,3.0,-0.234357,0.253915,-0.400816,-0.380484,-0.360151,-0.151127,0.057897
b,2.0,-0.485733,0.125517,-0.574487,-0.530110,-0.485733,-0.441356,-0.396979

In [40]:
df.groupby('key1').agg(['mean','std',range])

         data1                         data2
          mean       std     range      mean       std     range
key1
a    -0.234357  0.253915  0.458713  0.693952  1.959048  3.903449
b    -0.485733  0.125517  0.177508 -0.681606  2.111566  2.986206

In [41]:
df.groupby('key1').agg({'data1':['min','mean'],'data2':[range,sum]})

         data1               data2
           min      mean     range       sum
key1
a    -0.400816 -0.234357  3.903449  2.081857
b    -0.574487 -0.485733  2.986206 -1.363212

In [42]:
df.groupby(['key1','key2']).agg({'data1':['min','mean'],'data2':[range,sum]})

              data1               data2
                min      mean     range       sum
key1 key2
a    one  -0.400816 -0.380484  1.658597  3.437339
     two   0.057897  0.057897  0.000000 -1.355481
b    one  -0.574487 -0.574487  0.000000 -2.174709
     two  -0.396979 -0.396979  0.000000  0.811497

In [43]:
df.groupby(['key1','key2'],as_index=False).agg({'data1':['min','mean'],'data2':[range,sum]})

  key1 key2     data1               data2
                  min      mean     range       sum
0    a  one -0.400816 -0.380484  1.658597  3.437339
1    a  two  0.057897  0.057897  0.000000 -1.355481
2    b  one -0.574487 -0.574487  0.000000 -2.174709
3    b  two -0.396979 -0.396979  0.000000  0.811497

In [44]:
##  apply function

## eg to return to 5 values in each group
def top(df,n=5,column='tip_pct'):
    return df.sort_values(by=column[-n:])

## tips.groupby('smoker').apply(top)
## tips.groupby('smoker').apply(top,n=1,column='total_bill')

In [45]:
frame=pd.DataFrame({'data1':np.random.randn(1000),'data2':np.random.randn(1000)})
quartiles=pd.cut(frame.data1,4)
quartiles

0      (-1.703, 0.0216]
1      (-1.703, 0.0216]
2      (-1.703, 0.0216]
3       (0.0216, 1.746]
4      (-1.703, 0.0216]
             ...
995     (0.0216, 1.746]
996     (0.0216, 1.746]
997    (-1.703, 0.0216]
998     (0.0216, 1.746]
999     (0.0216, 1.746]
Name: data1, Length: 1000, dtype: category
Categories (4, interval[float64]): [(-3.434, -1.703] < (-1.703, 0.0216] < (0.0216, 1.746] < (1.746, 3.47]]

In [46]:
quartiles[:10]

0    (-1.703, 0.0216]
1    (-1.703, 0.0216]
2    (-1.703, 0.0216]
3     (0.0216, 1.746]
4    (-1.703, 0.0216]
5    (-1.703, 0.0216]
6     (0.0216, 1.746]
7    (-1.703, 0.0216]
8    (-1.703, 0.0216]
9    (-1.703, 0.0216]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.434, -1.703] < (-1.703, 0.0216] < (0.0216, 1.746] < (1.746, 3.47]]

In [47]:
def get_stats(group):
    return {'min':group.min(),'max':group.max(),'count':group.count(),'mean':group.mean()}

grouped=frame.data2.groupby(quartiles)
grouped.apply(get_stats)

data1
(-3.434, -1.703]  min       -1.384355
                  max        2.525448
                  count     40.000000
                  mean      -0.044238
(-1.703, 0.0216]  min       -3.183455
                  max        3.003513
                  count    481.000000
                  mean      -0.051227
(0.0216, 1.746]   min       -3.091958
                  max        2.802554
                  count    439.000000
                  mean       0.011374
(1.746, 3.47]     min       -1.838001
                  max        1.480307
                  count     40.000000
                  mean       0.206030
Name: data2, dtype: float64

In [48]:
grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-3.434, -1.703] -1.384355  2.525448   40.0 -0.044238
(-1.703, 0.0216] -3.183455  3.003513  481.0 -0.051227
(0.0216, 1.746]  -3.091958  2.802554  439.0  0.011374
(1.746, 3.47]    -1.838001  1.480307   40.0  0.206030

In [49]:
grouping=pd.qcut(frame.data1,10)
group=frame.data2.groupby(grouping)
group.apply(get_stats).unstack()

                        min       max  count      mean
data1
(-3.428, -1.261]  -2.297958  2.525448  100.0  0.049646
(-1.261, -0.813]  -2.440762  3.003513  100.0 -0.054116
(-0.813, -0.522]  -3.183455  1.764434  100.0  0.005166
(-0.522, -0.277]  -2.639100  2.368521  100.0 -0.160595
(-0.277, -0.0366] -2.446476  2.486657  100.0 -0.115226
(-0.0366, 0.228]  -3.091958  2.276383  100.0 -0.033653
(0.228, 0.45]     -2.477128  2.802554  100.0  0.186650
(0.45, 0.805]     -1.989476  2.757276  100.0  0.170316
(0.805, 1.225]    -2.595321  2.677807  100.0 -0.149354
(1.225, 3.47]     -2.269975  1.733923  100.0 -0.030591

In [50]:
## filling missing values with group specfic values
s=pd.Series(np.random.randn(10))
s[::2]=np.nan
s

0         NaN
1    0.177982
2         NaN
3   -1.162993
4         NaN
5   -1.134622
6         NaN
7   -2.167534
8         NaN
9    0.361860
dtype: float64

In [51]:
s.fillna(s.mean())

0   -0.785061
1    0.177982
2   -0.785061
3   -1.162993
4   -0.785061
5   -1.134622
6   -0.785061
7   -2.167534
8   -0.785061
9    0.361860
dtype: float64

In [52]:
states=['ohio','new york','vermont','florida','oregon','nevada','california','idaho']
group_key=['East']*4+['West']*4
data=pd.Series(np.random.randn(8),index=states)
data

ohio         -1.880379
new york      0.400468
vermont       0.706289
florida      -0.043154
oregon        0.457382
nevada        0.929207
california    2.059659
idaho        -0.064616
dtype: float64

In [53]:
data[['vermont','nevada','idaho']]=np.nan

In [54]:
data

ohio         -1.880379
new york      0.400468
vermont            NaN
florida      -0.043154
oregon        0.457382
nevada             NaN
california    2.059659
idaho              NaN
dtype: float64

In [55]:
data_replaced=data.groupby(group_key).apply(lambda x:x.fillna(x.mean()))
data_replaced

ohio         -1.880379
new york      0.400468
vermont      -0.507688
florida      -0.043154
oregon        0.457382
nevada        1.258520
california    2.059659
idaho         1.258520
dtype: float64

In [56]:
data.groupby(group_key).mean()

East   -0.507688
West    1.258520
dtype: float64

In [57]:
fill_values={'East':0.5,'West':-1}
data_replaced=data.groupby(group_key).apply(lambda x:x.fillna(fill_values[x.name]))
data_replaced

ohio         -1.880379
new york      0.400468
vermont       0.500000
florida      -0.043154
oregon        0.457382
nevada       -1.000000
california    2.059659
idaho        -1.000000
dtype: float64

In [58]:
n=15
times=pd.date_range('2017-05-20 00:00',freq='1min',periods=n)
df=pd.DataFrame({'time':times,'value':np.arange(n)})
df

                  time  value
0  2017-05-20 00:00:00      0
1  2017-05-20 00:01:00      1
2  2017-05-20 00:02:00      2
3  2017-05-20 00:03:00      3
4  2017-05-20 00:04:00      4
5  2017-05-20 00:05:00      5
6  2017-05-20 00:06:00      6
7  2017-05-20 00:07:00      7
8  2017-05-20 00:08:00      8
9  2017-05-20 00:09:00      9
10 2017-05-20 00:10:00     10
11 2017-05-20 00:11:00     11
12 2017-05-20 00:12:00     12
13 2017-05-20 00:13:00     13
14 2017-05-20 00:14:00     14

In [61]:
df.set_index('time').resample('5min').count()

                     value
time
2017-05-20 00:00:00      5
2017-05-20 00:05:00      5
2017-05-20 00:10:00      5

In [65]:

df=pd.DataFrame({'time':times.repeat(3),
                 'key':np.tile(['a','b','c'],n),
                'value':np.arange(n*3.)})
df

                  time key  value
0  2017-05-20 00:00:00   a    0.0
1  2017-05-20 00:00:00   b    1.0
2  2017-05-20 00:00:00   c    2.0
3  2017-05-20 00:01:00   a    3.0
4  2017-05-20 00:01:00   b    4.0
5  2017-05-20 00:01:00   c    5.0
6  2017-05-20 00:02:00   a    6.0
7  2017-05-20 00:02:00   b    7.0
8  2017-05-20 00:02:00   c    8.0
9  2017-05-20 00:03:00   a    9.0
10 2017-05-20 00:03:00   b   10.0
11 2017-05-20 00:03:00   c   11.0
12 2017-05-20 00:04:00   a   12.0
13 2017-05-20 00:04:00   b   13.0
14 2017-05-20 00:04:00   c   14.0
15 2017-05-20 00:05:00   a   15.0
16 2017-05-20 00:05:00   b   16.0
17 2017-05-20 00:05:00   c   17.0
18 2017-05-20 00:06:00   a   18.0
19 2017-05-20 00:06:00   b   19.0
20 2017-05-20 00:06:00   c   20.0
21 2017-05-20 00:07:00   a   21.0
22 2017-05-20 00:07:00   b   22.0
23 2017-05-20 00:07:00   c   23.0
24 2017-05-20 00:08:00   a   24.0
25 2017-05-20 00:08:00   b   25.0
26 2017-05-20 00:08:00   c   26.0
27 2017-05-20 00:09:00   a   27.0
28 2017-05-20 00:09:00   b   28.0
29 2017-05-20 00:09:00   c   29.0
30 2017-05-20 00:10:00   a   30.0
31 2017-05-20 00:10:00   b   31.0
32 2017-05-20 00:10:00   c   32.0
33 2017-05-20 00:11:00   a   33.0
34 2017-05-20 00:11:00   b   34.0
35 2017-05-20 00:11:00   c   35.0
36 2017-05-20 00:12:00   a   36.0
37 2017-05-20 00:12:00   b   37.0
38 2017-05-20 00:12:00   c   38.0
39 2017-05-20 00:13:00   a   39.0
40 2017-05-20 00:13:00   b   40.0
41 2017-05-20 00:13:00   c   41.0
42 2017-05-20 00:14:00   a   42.0
43 2017-05-20 00:14:00   b   43.0
44 2017-05-20 00:14:00   c   44.0

In [64]:
time_key=pd.TimeGrouper('5min')
resampled=(df.set_index('time').
          groupby(['key',time_key]).
          sum())
resampled

AttributeError: module 'pandas' has no attribute 'TimeGrouper'

In [66]:
## assign df2=df.assign(k=v)

In [1]:
## method chaining
## df=loaddata()
## df2=df[df['col2']<0]
##result=(load_data()
##       [lambda x:x.col2<0]
##       .assign(col1_demenaed=lambda x:x.col1-x.col1.mean())
##       .group('key')
##       .col1_demenaed.std())